#**Install dependencies**

In [1]:
!pip install pymongo

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pymongo
  Downloading pymongo-4.3.3-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (492 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 492.1/492.1 kB 6.3 MB/s eta 0:00:00
Collecting dnspython<3.0.0,>=1.16.0
  Downloading dnspython-2.3.0-py3-none-any.whl (283 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 283.7/283.7 kB 4.1 MB/s eta 0:00:00
Installing collected packages: dnspython, pymongo
Successfully installed dnspython-2.3.0 pymongo-4.3.3

#**Import libraries**

In [2]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import pymongo
from getpass import getpass
import sqlite3
# import sqlite3
from sqlalchemy import create_engine
from sqlalchemy import text as sql_text

**SQLite Engine**

#**Functions**

**Fetch data from imdb**

In [3]:
sql_engine = create_engine("sqlite:///foo.db")

In [4]:
def get_data(link: str, pages: int):
    # link = "https://www.imdb.com/search/title/?groups=top_100&sort=user_rating,desc"
    # pages = 2
    data = []
    for page in range(pages):
        url = f"{link}&start={page*50}"
        ack = requests.get(url)
        getdata = BeautifulSoup(ack.content, "html.parser")

        movies = getdata.find_all("div", {"class": "lister-item mode-advanced"})
        for movie in movies:
            rank = (
                movie.find_all("span", {"name": "nv"})[-1].text.strip("#")
                if len(movie.find_all("span", {"name": "nv"})) > 1
                else ""
            )
            name = movie.find("h3", {"class": "lister-item-header"}).a.text.strip()
            year = movie.find("span", {"class": "lister-item-year"}).text.strip("()")
            rating = movie.find("div", {"class": "inline-block ratings-imdb-rating"})[
                "data-value"
            ]
            duration = movie.find("span", {"class": "runtime"}).text.strip(" min")
            metascore = (
                movie.find("span", {"class": "metascore"}).text.strip()
                if movie.find("span", {"class": "metascore"})
                else ""
            )
            directors = [
                director.text
                for director in movie.find_all(
                    "a", {"href": lambda href: href and "/name/" in href}
                )
            ]
            director = directors[0] if directors else ""

            data.append([rank, name, year, rating, duration, metascore, director])
    return pd.DataFrame(
        data,
        columns=[
            "Rank",
            "Name",
            "Year",
            "Rating",
            "Duration (mins)",
            "Metascore",
            "Director",
        ],
    )

**Insert data into mongo**

In [5]:
def insert_into_db(uri: str, data_frame: pd.DataFrame):
    client = pymongo.MongoClient(uri)
    db = client["Jisons"]
    collection = db["movies"]
    data_dict = data_frame.to_dict(orient="records")
    # drop collection if already exists
    if db.drop_collection("movies"):
        print(f"Dropped already existing collection!")
    collection.insert_many(data_dict)
    client.close()

**Test mongodb Query**

In [6]:
def test_query(uri: str):
    client = pymongo.MongoClient(uri)
    db = client["Jisons"]
    collection = db["movies"]

    documents = collection.find().limit(100)
    document_list = list(documents)
    df2 = pd.DataFrame(document_list)
    return df2
    # print(df2.head(10))

#**Main Code**
**set up mongodb connections**

In [7]:
mongo_db_password = getpass() # 1WgLZ0xLWIAXPvJe
db_uri = f"mongodb+srv://tulikayadav16:{mongo_db_password}@cluster0.ykvdygv.mongodb.net/?retryWrites=true&w=majority"
link = "https://www.imdb.com/search/title/?groups=top_100&sort=user_rating,desc"
pages = 2

··········

In [8]:
df = get_data(link=link, pages=pages)
insert_into_db(uri=db_uri, data_frame=df)

Dropped already existing collection!

In [9]:
query_df = test_query(db_uri)
display(query_df)

,_id,Rank,Name,Year,Rating,Duration (mins),Metascore,Director
0,644505d57b192f824feb7cdf,1,The Shawshank Redemption,1994,9.3,142,82,Frank Darabont
1,644505d57b192f824feb7ce0,2,The Godfather,1972,9.2,175,100,Francis Ford Coppola
2,644505d57b192f824feb7ce1,3,The Dark Knight,2008,9,152,84,Christopher Nolan
3,644505d57b192f824feb7ce2,6,Schindler's List,1993,9,195,95,Oskar Schindler
4,644505d57b192f824feb7ce3,7,The Lord of the Rings: The Return of the King,2003,9,201,94,Peter Jackson
...,...,...,...,...,...,...,...,...
95,644505d57b192f824feb7d3e,87,Toy Story 3,2010,8.3,103,92,Lee Unkrich
96,644505d57b192f824feb7d3f,100,Vertigo,1958,8.3,128,100,Alfred Hitchcock
97,644505d57b192f824feb7d40,99,North by Northwest,1959,8.3,136,98,Alfred Hitchcock
98,644505d57b192f824feb7d41,83,Singin' in the Rain,1952,8.3,103,99,Stanley Donen
99,644505d57b192f824feb7d42,98,Ikiru,1952,8.3,143,91,Akira Kurosawa

In [10]:
query_df.drop("_id", inplace=True, axis=1)

In [11]:
query_df.columns = [
    i.lower().replace(" ", "_").replace("(", "").replace(")", "")
    for i in query_df.columns
]

In [12]:
query_df.head()

,rank,name,year,rating,duration_mins,metascore,director
0,1,The Shawshank Redemption,1994,9.3,142,82,Frank Darabont
1,2,The Godfather,1972,9.2,175,100,Francis Ford Coppola
2,3,The Dark Knight,2008,9,152,84,Christopher Nolan
3,6,Schindler's List,1993,9,195,95,Oskar Schindler
4,7,The Lord of the Rings: The Return of the King,2003,9,201,94,Peter Jackson

# **Insert into SQLite**

**Execute Queries**

In [13]:
query_df.columns

Index(['rank', 'name', 'year', 'rating', 'duration_mins', 'metascore',
       'director'],
      dtype='object')

In [36]:
query_df.to_sql(name='movie_inf', con=sql_engine, index=True, index_label=None)

100

In [37]:
con = sqlite3.connect('foo.db')
c = con.cursor()

In [38]:
rs=c.execute('SELECT * From movie_info')

In [39]:
df = pd.DataFrame(rs.fetchall())

In [40]:
con.close()
print(df.head())

   0  1                                              2     3    4    5    6  \
0  0  1                       The Shawshank Redemption  1994  9.3  142   82
1  1  2                                  The Godfather  1972  9.2  175  100
2  2  3                                The Dark Knight  2008    9  152   84
3  3  6                               Schindler's List  1993    9  195   95
4  4  7  The Lord of the Rings: The Return of the King  2003    9  201   94

                      7
0        Frank Darabont
1  Francis Ford Coppola
2     Christopher Nolan
3       Oskar Schindler
4         Peter Jackson

1)Short list a movies which start with name 'The' and rating above 8 with descending order of rating.

In [62]:
# Open sqlite in context manager
# Perform query and save results to DataFrame: df
with sqlite3.connect('foo.db') as con:
  c = con.cursor()
  rs=c.execute("SELECT name, year, rating, director, metascore FROM movie_info Where rating > 8 AND name Like 'The%' Order By rating DESC ")
  df = pd.DataFrame(rs.fetchall())
  
# Print the length of the DataFrame df
print(len(df))

# Print the head of the DataFrame df
print(df)

22
                                                    0     1    2  \
0                            The Shawshank Redemption  1994  9.3
1                                       The Godfather  1972  9.2
2                                     The Dark Knight  2008    9
3       The Lord of the Rings: The Return of the King  2003    9
4                               The Godfather Part II  1974    9
5   The Lord of the Rings: The Fellowship of the Ring  2001  8.8
6                      The Good, the Bad and the Ugly  1966  8.8
7               The Lord of the Rings: The Two Towers  2002  8.8
8                                          The Matrix  1999  8.7
9                            The Silence of the Lambs  1991  8.6
10                                     The Green Mile  1999  8.6
11                                       The Departed  2006  8.5
12                                       The Prestige  2006  8.5
13                                        The Pianist  2002  8.5
14                                      The Lion King  1994  8.5
15                                 The Usual Suspects  1995  8.5
16                                   The Intouchables  2011  8.5
17                                        The Shining  1980  8.4
18                              The Dark Knight Rises  2012  8.4
19                                The Lives of Others  2006  8.4
20                                 The Great Dictator  1940  8.4
21                                           The Hunt  2012  8.3

                                   3    4
0                     Frank Darabont   82
1               Francis Ford Coppola  100
2                  Christopher Nolan   84
3                      Peter Jackson   94
4               Francis Ford Coppola   90
5                      Peter Jackson   92
6                       Sergio Leone   90
7                      Peter Jackson   87
8                     Lana Wachowski   73
9                     Jonathan Demme   86
10                    Frank Darabont   61
11                   Martin Scorsese   85
12                 Christopher Nolan   66
13                    Roman Polanski   85
14                      Roger Allers   88
15                      Bryan Singer   77
16                   Olivier Nakache   57
17                   Stanley Kubrick   66
18                 Christopher Nolan   78
19  Florian Henckel von Donnersmarck   89
20                   Charles Chaplin
21                 Thomas Vinterberg   77

2)Short list a movies which metascore more than 80 and order by descending rating wise.

In [59]:
# Open sqlite in context manager
# Perform query and save results to DataFrame: df
with sqlite3.connect('foo.db') as con:
  c = con.cursor()
  rs = c.execute('SELECT name, year, rating, metascore FROM movie_info Where metascore > 80 order by rating desc')
  df = pd.DataFrame(rs.fetchall())

# Print the length of the DataFrame df
print(len(df))

# Print the head of the DataFrame df
print(df)

57
                                                    0         1    2   3
0                            The Shawshank Redemption      1994  9.3  82
1                                     The Dark Knight      2008    9  84
2                                    Schindler's List      1993    9  95
3       The Lord of the Rings: The Return of the King      2003    9  94
4                                        12 Angry Men      1957    9  97
5                               The Godfather Part II      1974    9  90
6                                        Pulp Fiction      1994  8.9  95
7   The Lord of the Rings: The Fellowship of the Ring      2001  8.8  92
8                                        Forrest Gump      1994  8.8  82
9                      The Good, the Bad and the Ugly      1966  8.8  90
10              The Lord of the Rings: The Two Towers      2002  8.8  87
11                                         Goodfellas      1990  8.7  91
12                    One Flew Over the Cuckoo's Nest      1975  8.7  84
13     Star Wars: Episode V - The Empire Strikes Back      1980  8.7  82
14                                          Star Wars      1977  8.6  90
15                           The Silence of the Lambs      1991  8.6  86
16                                      Spirited Away      2001  8.6  96
17                                Saving Private Ryan      1998  8.6  91
18                                      Seven Samurai      1954  8.6  98
19                              It's a Wonderful Life      1946  8.6  89
20                                           Harakiri      1962  8.6  85
21                                           Whiplash      2014  8.5  89
22                                           Parasite      2019  8.5  96
23                                       The Departed      2006  8.5  85
24                                 Back to the Future      1985  8.5  87
25                                             Psycho      1960  8.5  97
26                                              Alien      1979  8.5  89
27                                     Apocalypse Now      1979  8.5  94
28                                        The Pianist      2002  8.5  85
29                                      The Lion King      1994  8.5  88
30                       Once Upon a Time in the West      1968  8.5  82
31                             Grave of the Fireflies      1988  8.5  94
32                                       Modern Times      1936  8.5  96
33                                        City Lights      1931  8.5  99
34                            Raiders of the Lost Ark      1981  8.4  85
35                  Spider-Man: Into the Spider-Verse      2018  8.4  87
36                                   Django Unchained      2012  8.4  81
37                                            Memento      2000  8.4  81
38                                             Aliens      1986  8.4  84
39                                               Coco  I) (2017  8.4  81
40                                             WALL·E      2008  8.4  95
41                                            Amadeus      1984  8.4  88
42                                The Lives of Others      2006  8.4  89
43  Dr. Strangelove or: How I Learned to Stop Worr...      1964  8.4  97
44                                           Das Boot      1981  8.4  86
45                                       Sunset Blvd.      1950  8.4  94
46                                     Paths of Glory      1957  8.4  90
47                                       High and Low      1963  8.4  90
48                                    American Beauty      1999  8.3  84
49                              2001: A Space Odyssey      1968  8.3  84
50              Eternal Sunshine of the Spotless Mind      2004  8.3  89
51                                     Reservoir Dogs      1992  8.3  81
52                                          Toy Story      1995  8.3  96
53                                        Toy Story 3      2010  8.3  92
54                                 North by Northwest      1959  8.3  98
55                                Singin' in the Rain      1952  8.3  99
56                                              Ikiru      1952  8.3  91

3) List movies between 2010 and 2020 order descending year vise

In [43]:
# Open sqlite in context manager
# Perform query and save results to DataFrame: df
with sqlite3.connect('foo.db') as con:
  c = con.cursor()
  rs = c.execute('SELECT name, duration_mins, year, rating, metascore, director FROM movie_info Where year Between 2010 and 2020 Order By year Desc')
  df = pd.DataFrame(rs.fetchall())
  

# Print the length of the DataFrame df
print(len(df))

# Print the head of the DataFrame df
print(df)

14
                                    0    1     2    3   4                  5
0                            Parasite  132  2019  8.5  96       Bong Joon Ho
1                   Avengers: Endgame  181  2019  8.4  78      Anthony Russo
2   Spider-Man: Into the Spider-Verse  117  2018  8.4  87    Bob Persichetti
3              Avengers: Infinity War  149  2018  8.4  68      Anthony Russo
4                           Capernaum  126  2018  8.4  75      Nadine Labaki
5                          Your Name.  106  2016  8.4  79     Makoto Shinkai
6                        Interstellar  169  2014  8.6  74  Christopher Nolan
7                            Whiplash  106  2014  8.5  89    Damien Chazelle
8                    Django Unchained  165  2012  8.4  81  Quentin Tarantino
9               The Dark Knight Rises  164  2012  8.4  78  Christopher Nolan
10                           The Hunt  115  2012  8.3  77  Thomas Vinterberg
11                   The Intouchables  112  2011  8.5  57    Olivier Nakache
12                          Inception  148  2010  8.8  74  Christopher Nolan
13                        Toy Story 3  103  2010  8.3  92        Lee Unkrich

4)Short list a movies group by director and rating above 7 with descending order of its count.

In [61]:
# Open sqlite in context manager
# Perform query and save results to DataFrame: df
with sqlite3.connect('foo.db') as con:
  c = con.cursor()
  rs = c.execute('SELECT director, count(director) as movie_count FROM movie_info Group By director order by movie_count desc')
  df = pd.DataFrame(rs.fetchall())
  

# Print the length of the DataFrame df
print(len(df))

# Print the head of the DataFrame df
print(df)

65
                    0  1
0   Christopher Nolan  6
1    Alfred Hitchcock  5
2     Stanley Kubrick  4
3   Quentin Tarantino  4
4        Sergio Leone  3
..                ... ..
60    Damien Chazelle  1
61       Bryan Singer  1
62       Bong Joon Ho  1
63    Bob Persichetti  1
64     Andrew Stanton  1

[65 rows x 2 columns]